* Question
:PROPERTIES:
:header-args:scheme: eval no
:END:
The following data base (see Genesis 4) traces the genealogy of the descendants of Ada back to Adam, by way of Cain:

#+begin_src scheme
  (son Adam Cain)
  (son Cain Enoch)
  (son Enoch Irad)
  (son Irad Mehujael)
  (son Mehujael Methushael)
  (son Methushael Lamech)
  (wife Lamech Ada)
  (son Ada Jabal)
  (son Ada Jubal)
#+end_src

Formulate rules such as "If S is the son of F, and F is the son of G, then S is the grandson of G" and "If W is the wife of M, and S is the son of W, then S is the son of M" (which was supposedly more true in biblical times than today) that will enable the query system to find the grandson of Cain; the sons of Lamech; the grandsons of Methushael. (See exercise 4.69 for some rules to deduce more complicated relationships.)

* Answer
** Implementation
:PROPERTIES:
:header-args:scheme: eval no
:END:
#+begin_src scheme :tangle 4.63.query.grandson.scm
  (define (install-grandson)
    (for-each mc-eval
              (list '(assert!
                      (rule (son ?father ?son)
                            (and (wife ?father ?wife)
                                 (son ?wife ?son))))
                    '(assert!
                      (rule (grandson ?grandfather ?grandson)
                            (and (son ?grandfather ?father)
                                 (son ?father ?grandson)))))))
#+end_src


#+begin_src scheme :tangle 4.63.query.genesis.scm
  ;; Inherit
  (load "4.query.scm")
  ;; Setup
  (load "4.63.query.grandson.scm")
  (install-grandson)
  (initialize-data-base
   '((son Adam Cain)
     (son Cain Enoch)
     (son Enoch Irad)
     (son Irad Mehujael)
     (son Mehujael Methushael)
     (son Methushael Lamech)
     (wife Lamech Ada)
     (son Ada Jabal)
     (son Ada Jubal)))
#+end_src

** Test
#+begin_src scheme :results output :exports both
  ;; Load
  (load "4.63.query.genesis.scm")
  ;; Test
  (for-each mc-eval
            (list '(grandson Cain ?x)
                  '(son Lamech ?x)
                  '(grandson Methushael ?x)))
#+end_src

#+RESULTS:
#+begin_example

Assertion added to data base.
Assertion added to data base.
;;; Query results:
(grandson cain irad)
;;; Query results:
(son lamech jubal)
(son lamech jabal)
;;; Query results:
(grandson methushael jubal)
(grandson methushael jabal)
#+end_example
